In [5]:
from sqlalchemy import create_engine
import pandas as pd

engine = create_engine("mysql+mysqlconnector://root:Mysql%40123@127.0.0.1:3306/etl_practice")
# Read data from a table
df = pd.read_sql("SELECT * FROM employees", engine)
df.head()

   emp_id    name  department_id   salary
0       1  Anjali             10  50000.0
1       2  Bharat             10  60000.0
2       3  Chetan             20  40000.0
3       4   Divya             20  55000.0
4       5    Esha             30  72000.0